In [4]:
#pandas

In [2]:
import pandas as pd
import numpy as np

In [3]:
labels=['a','b','c']
my_list=[1,2,3]
arr=np.array([10,11,12])
d={'a':10,'b':12,"c":13}

In [4]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [5]:
pd.Series(data=my_list,index=labels)

a    1
b    2
c    3
dtype: int64

In [6]:
pd.Series(arr,labels)#by default first is data

a    10
b    11
c    12
dtype: int64

In [7]:
pd.Series(d)

a    10
b    12
c    13
dtype: int64

In [8]:
from numpy.random import randn
np.random.seed(101)

In [9]:
df=pd.DataFrame(randn(5,5),index=["a",'b','c','d','e'])

In [10]:
df

          0         1         2         3         4
a  2.706850  0.628133  0.907969  0.503826  0.651118
b -0.319318 -0.848077  0.605965 -2.018168  0.740122
c  0.528813 -0.589001  0.188695 -0.758872 -0.933237
d  0.955057  0.190794  1.978757  2.605967  0.683509
e  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [11]:
df=pd.DataFrame(randn(5,5),index=["a",'b','c','d','e'],columns=["w",'y','z','e','t'])

In [12]:
df

          w         y         z         e         t
a  0.390528  0.166905  0.184502  0.807706  0.072960
b  0.638787  0.329646 -0.497104 -0.754070 -0.943406
c  0.484752 -0.116773  1.901755  0.238127  1.996652
d -0.993263  0.196800 -1.136645  0.000366  1.025984
e -0.156598 -0.031579  0.649826  2.154846 -0.610259

In [13]:
df["w"]

a    0.390528
b    0.638787
c    0.484752
d   -0.993263
e   -0.156598
Name: w, dtype: float64

In [14]:
df.w

a    0.390528
b    0.638787
c    0.484752
d   -0.993263
e   -0.156598
Name: w, dtype: float64

In [15]:
df.loc["a"]

w    0.390528
y    0.166905
z    0.184502
e    0.807706
t    0.072960
Name: a, dtype: float64

In [16]:
df1=df[['w','y']]

In [17]:
df1

          w         y
a  0.390528  0.166905
b  0.638787  0.329646
c  0.484752 -0.116773
d -0.993263  0.196800
e -0.156598 -0.031579

In [18]:
df.drop(['w'],axis=1,inplace=True)

In [19]:
df1

          w         y
a  0.390528  0.166905
b  0.638787  0.329646
c  0.484752 -0.116773
d -0.993263  0.196800
e -0.156598 -0.031579

In [20]:
df

          y         z         e         t
a  0.166905  0.184502  0.807706  0.072960
b  0.329646 -0.497104 -0.754070 -0.943406
c -0.116773  1.901755  0.238127  1.996652
d  0.196800 -1.136645  0.000366  1.025984
e -0.031579  0.649826  2.154846 -0.610259

In [21]:
df.drop("a",0)

          y         z         e         t
b  0.329646 -0.497104 -0.754070 -0.943406
c -0.116773  1.901755  0.238127  1.996652
d  0.196800 -1.136645  0.000366  1.025984
e -0.031579  0.649826  2.154846 -0.610259

In [22]:
#working on row

In [23]:
df

          y         z         e         t
a  0.166905  0.184502  0.807706  0.072960
b  0.329646 -0.497104 -0.754070 -0.943406
c -0.116773  1.901755  0.238127  1.996652
d  0.196800 -1.136645  0.000366  1.025984
e -0.031579  0.649826  2.154846 -0.610259

In [24]:
df.loc["a"]

y    0.166905
z    0.184502
e    0.807706
t    0.072960
Name: a, dtype: float64

In [25]:
df.iloc[0]

y    0.166905
z    0.184502
e    0.807706
t    0.072960
Name: a, dtype: float64

In [26]:
df.iloc[4]

y   -0.031579
z    0.649826
e    2.154846
t   -0.610259
Name: e, dtype: float64

In [27]:
df.loc["a","y"]

0.16690463609281317

In [28]:
df.loc[['a','b'],['y','t']]

          y         t
a  0.166905  0.072960
b  0.329646 -0.943406

In [29]:
df>0

       y      z      e      t
a   True   True   True   True
b   True  False  False  False
c  False   True   True   True
d   True  False   True   True
e  False   True   True  False

In [30]:
df[df>0]

          y         z         e         t
a  0.166905  0.184502  0.807706  0.072960
b  0.329646       NaN       NaN       NaN
c       NaN  1.901755  0.238127  1.996652
d  0.196800       NaN  0.000366  1.025984
e       NaN  0.649826  2.154846       NaN

In [31]:
df[df["t"]>0]["y"]

a    0.166905
c   -0.116773
d    0.196800
Name: y, dtype: float64

In [32]:
df.reset_index()

  index         y         z         e         t
0     a  0.166905  0.184502  0.807706  0.072960
1     b  0.329646 -0.497104 -0.754070 -0.943406
2     c -0.116773  1.901755  0.238127  1.996652
3     d  0.196800 -1.136645  0.000366  1.025984
4     e -0.031579  0.649826  2.154846 -0.610259

In [33]:
a=['a','b','c','d','e']

In [34]:
df["New"]=a

In [35]:
df.set_index("New",inplace =True)

In [36]:
df

            y         z         e         t
New
a    0.166905  0.184502  0.807706  0.072960
b    0.329646 -0.497104 -0.754070 -0.943406
c   -0.116773  1.901755  0.238127  1.996652
d    0.196800 -1.136645  0.000366  1.025984
e   -0.031579  0.649826  2.154846 -0.610259

In [37]:
#missing data

In [38]:
df=pd.DataFrame({'a':[1,2,np.nan,np.nan],'b':[2,np.nan,np.nan,5]})

In [39]:
df

     a    b
0  1.0  2.0
1  2.0  NaN
2  NaN  NaN
3  NaN  5.0

In [40]:
df.dropna()

     a    b
0  1.0  2.0

In [41]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [42]:
df.fillna(value=0)

     a    b
0  1.0  2.0
1  2.0  0.0
2  0.0  0.0
3  0.0  5.0

In [43]:
df.fillna(value=df["a"].mean())

     a    b
0  1.0  2.0
1  2.0  1.5
2  1.5  1.5
3  1.5  5.0

In [44]:
#merging,concat

In [45]:
df1=pd.DataFrame({'A':['a','b','c'],"B":['d','e','f'],"C":['s','e','f']})

In [46]:
df2=pd.DataFrame({'A':['a1','b2','c2'],"B":['d1','e2','f3'],"C":['s1','e2','f2']})

In [47]:
pd.concat([df1,df2])

    A   B   C
0   a   d   s
1   b   e   e
2   c   f   f
0  a1  d1  s1
1  b2  e2  e2
2  c2  f3  f2

In [48]:
pd.concat([df2,df2],axis=1)

    A   B   C   A   B   C
0  a1  d1  s1  a1  d1  s1
1  b2  e2  e2  b2  e2  e2
2  c2  f3  f2  c2  f3  f2

In [49]:
pd.merge(df1,df2,how="outer",on=["A","B","C"])

    A   B   C
0   a   d   s
1   b   e   e
2   c   f   f
3  a1  d1  s1
4  b2  e2  e2
5  c2  f3  f2

In [50]:
df3=pd.DataFrame({'L':['a','b','c'],"M":['d','e','f'],"M":['s','e','f']},index=[6,7,8])

In [51]:
df3.join(df1)

   L  M    A    B    C
6  a  s  NaN  NaN  NaN
7  b  e  NaN  NaN  NaN
8  c  f  NaN  NaN  NaN

In [52]:
#Basic Operation

In [53]:
df=pd.DataFrame({'L':[1,2,3,55],"N":[11,22,33,1],"M":['s','e','f','s']})

In [54]:
df["L"].unique()

array([ 1,  2,  3, 55])

In [55]:
df["M"].nunique()

3

In [56]:
#conditional selection

In [57]:
df1=df[(df["L"]<3)&(df["N"]<70)]

In [58]:
df1

   L   N  M
0  1  11  s
1  2  22  e

In [59]:
df.apply(len)

L    4
N    4
M    4
dtype: int64

In [60]:
df.sum()

L      61
N      67
M    sefs
dtype: object

In [61]:
del df["N"]

In [62]:
df.columns

Index(['L', 'M'], dtype='object')

In [63]:
df.sort_values(by="L")

    L  M
0   1  s
1   2  e
2   3  f
3  55  s

In [64]:
df.isnull()

       L      M
0  False  False
1  False  False
2  False  False
3  False  False

In [65]:
df3=pd.DataFrame({'L':['a','b','c'],"M":['d','e','f'],"M":['s','e','f']},index=[6,7,8])

In [66]:
df3.to_csv("data")

In [68]:
df3.to_csv("no_index",index=False)

In [70]:
df3.to_excel("excel.xlsx")